In [1]:
import numpy as np
import pandas as pd

data = pd.Series(np.random.randn(9),
                index=[['a', 'a', 'a', 'b', 'b', 'c', 'c', 'd', 'd'],
                [1, 2, 3, 1, 2, 3, 1, 2, 3]]
                )
data

a  1   -0.818766
   2   -0.031521
   3    0.032659
b  1    0.359819
   2    0.310440
c  3   -0.736389
   1   -1.321545
d  2   -0.087159
   3    0.405299
dtype: float64

In [2]:
data.index

MultiIndex([('a', 1),
            ('a', 2),
            ('a', 3),
            ('b', 1),
            ('b', 2),
            ('c', 3),
            ('c', 1),
            ('d', 2),
            ('d', 3)],
           )

In [4]:
data['a']

1   -0.818766
2   -0.031521
3    0.032659
dtype: float64

In [18]:
data['a']

1   -0.818766
2   -0.031521
3    0.032659
dtype: float64

In [21]:
data

a  1   -0.818766
   2   -0.031521
   3    0.032659
b  1    0.359819
   2    0.310440
c  3   -0.736389
   1   -1.321545
d  2   -0.087159
   3    0.405299
dtype: float64

In [22]:
data.unstack(level=1).fillna(0)

          1         2         3
a -0.818766 -0.031521  0.032659
b  0.359819  0.310440  0.000000
c -1.321545  0.000000 -0.736389
d  0.000000 -0.087159  0.405299

In [24]:
data.unstack(level=0).fillna(0)

          a         b         c         d
1 -0.818766  0.359819 -1.321545  0.000000
2 -0.031521  0.310440  0.000000 -0.087159
3  0.032659  0.000000 -0.736389  0.405299

In [25]:
data = pd.DataFrame(np.arange(6).reshape((2, 3)),
                   index=pd.Index(['台北', '台中'], name='縣市'),
                   columns=pd.Index(['one','two', 'three'], name='number'))
data

number  one  two  three
縣市
台北        0    1      2
台中        3    4      5

In [29]:
data.stack().unstack(level=0)

縣市      台北  台中
number
one      0   3
two      1   4
three    2   5

In [31]:
data.T

縣市      台北  台中
number
one      0   3
two      1   4
three    2   5

In [32]:
#欄位變為索引
frame = pd.DataFrame({'a':range(7), 'b':range(7, 0, -1),
                     'c':['one', 'one', 'one', 'two', 'two', 'two', 'two'],
                     'd':[0, 1, 2, 0, 1, 2, 3]})
frame

   a  b    c  d
0  0  7  one  0
1  1  6  one  1
2  2  5  one  2
3  3  4  two  0
4  4  3  two  1
5  5  2  two  2
6  6  1  two  3

In [33]:
#set_index()
frame.set_index(keys='c')

     a  b  d
c
one  0  7  0
one  1  6  1
one  2  5  2
two  3  4  0
two  4  3  1
two  5  2  2
two  6  1  3

In [36]:
frame1=frame.set_index(keys=['c','d'])
frame1

       a  b
c   d
one 0  0  7
    1  1  6
    2  2  5
two 0  3  4
    1  4  3
    2  5  2
    3  6  1

In [38]:
frame1.unstack(level=0).fillna(0)

     a         b
c  one  two  one  two
d
0  0.0  3.0  7.0  4.0
1  1.0  4.0  6.0  3.0
2  2.0  5.0  5.0  2.0
3  0.0  6.0  0.0  1.0

In [41]:
frame1.unstack(level=1).fillna(0)

       a                   b
d      0    1    2    3    0    1    2    3
c
one  0.0  1.0  2.0  0.0  7.0  6.0  5.0  0.0
two  3.0  4.0  5.0  6.0  4.0  3.0  2.0  1.0

In [53]:
#將索引變為欄位
#reset_index()
frame2 = frame1.reset_index().set_index(keys=['c','d','a'])
frame3 = frame2.stack().droplevel(level=3)
frame3

c    d  a
one  0  0    7
     1  1    6
     2  2    5
two  0  3    4
     1  4    3
     2  5    2
     3  6    1
dtype: int64

In [54]:
frame3.unstack(level=['c','d'])

c  one            two
d    0    1    2    0    1    2    3
a
0  7.0  NaN  NaN  NaN  NaN  NaN  NaN
1  NaN  6.0  NaN  NaN  NaN  NaN  NaN
2  NaN  NaN  5.0  NaN  NaN  NaN  NaN
3  NaN  NaN  NaN  4.0  NaN  NaN  NaN
4  NaN  NaN  NaN  NaN  3.0  NaN  NaN
5  NaN  NaN  NaN  NaN  NaN  2.0  NaN
6  NaN  NaN  NaN  NaN  NaN  NaN  1.0